{"pageProps":{"post":{"title":"The Interpreter and Runner of uBlockly - Reimplementation of Google Blockly in Unity","date":"2021-06-12T11:00:00+08:00","slug":"2021-6-12-ublockly-interpreter-runner","ogImage":"/blog/assets/img-blockly/Demo.png","categories":["Unity"],"readTime":6,"content":"<h2 id=\"section-contents\">Contents</h2>\n<ol>\n<li><a href=\"/posts/2021-6-10-ublockly-introduction\" rel=\"noopener noreferrer\" target=\"_blank\">Introduction</a></li>\n<li><a href=\"/posts/2021-6-11-ublockly-model\" rel=\"noopener noreferrer\" target=\"_blank\">Blockly Model</a></li>\n<li>Interpreter and Runner</li>\n<li><a href=\"/posts/2021-6-13-ublockly-ugui\" rel=\"noopener noreferrer\" target=\"_blank\">UGUI Design</a></li>\n</ol>\n<p><br></p>\n<p>Google Blockly has code generators for translating blocks into code of dynamic languages. Then the code can run on corresponding runtime. It seems quite straightforward and simple. However, we are in Unity. I guess the dominating language in Unity is C#. <em>Correct me if I am wrong</em>😄</p>\n<p>C# is static. Obviously it doesn't work like the dynamic languages. So here, we need a <strong>interpreter</strong> to translate the block behaviors into C# execution functions, and a <strong>runner</strong> which controls the calling sequence of these functions.</p>\n<h2 id=\"section-interpreter\">Interpreter</h2>\n<p>Basically, an interpreter is a function that executes what the block does. However, the execution of a block's behavior may last for a duration, or involve internal state changes. An intuitive way is to use <code>class</code>. But I don't prefer it. </p>\n<p><em>Writing class code may sometimes divide a logic into different pieces in different class methods, e.g. implementing a timer may put the initiation logic in the <code>Start</code> method, the update logic in the <code>Update</code> method, and the reset logic in the <code>Finish</code> method.</em> </p>\n<p>This style may make code difficult to read and maintain in the future. I have used <strong>React.js</strong> for a while. In their improvements, I can see that they are making efforts to encourage us to write less class components, more functional components. The code is more explicit and concise.</p>\n<p>So I'd like my interpreter code stay just in a function. I chose <code>IEnumerator</code>. With Unity Coroutine, a function that returns <code>IEnumerator</code> can delay execution, and pause to wait until another process has completed. The code is similar to the <code>async</code> function in Javascript. Below is an example of the interpreter function:</p>\n<pre><code class=\"c# language-c#\">[CodeInterpreter(BlockType = \"logic_ternary\")]\npublic class Logic_Ternary_Cmdtor : EnumeratorCmdtor\n{\n    protected override IEnumerator Execute(Block block)\n    {\n        CmdEnumerator ctor = CSharp.Interpreter.ValueReturn(block, \"IF\", new DataStruct(false));\n        yield return ctor;\n\n          DataStruct condition = ctor.Data;\n                if (condition.BooleanValue)\n            yield return CSharp.Interpreter.StatementRun(block, \"THEN\");\n        else\n            yield return CSharp.Interpreter.StatementRun(block, \"ELSE\");\n    }\n}</code></pre>\n<p>I guess you will argue that it is a class! Honestly, it is a class. But all the code for block behaviors is put in the overrided <code>Execute</code> function. So you only to implement this function for your customized blocks.</p>\n<p>The underneath class implementation has some reasons:</p>\n<ol>\n<li><p>Carry data. Blocks may return data for another block to use.</p></li>\n<li><p>Unify the interface. There are three execution types of the block's behavior:</p>\n<ol>\n<li>a sync function that immediately returns a value.</li></ol>\n<pre><code class=\"c# language-c#\">   [CodeInterpreter(BlockType = \"logic_boolean\")]\n    public class Logic_Boolean_Cmdtor : ValueCmdtor\n    {\n        protected override DataStruct Execute(Block block)\n        {\n            string op = block.GetFieldValue(\"BOOL\");\n            switch (op)\n            {\n                case \"TRUE\": return new DataStruct(true);\n                case \"FALSE\": return new DataStruct(false);\n            }\n            return new DataStruct(false);\n        }\n    }</code></pre>\n<ol start=\"2\">\n<li>a sync function that returns nothing, <code>void</code>.</li></ol>\n<pre><code class=\"c# language-c#\">  [CodeInterpreter(BlockType = \"controls_flow_statements\")]\n  public class Control_FlowStatement_Cmdtor : VoidCmdtor\n  {\n      protected override void Execute(Block block)\n      {\n          LoopCmdtor loopCmdtor = LoopCmdtor.FindParentLoopCmdtor(block);\n          if (loopCmdtor == null)\n              throw new Exception(\"blocks of \\\"break\\\" and \\\"continue\\\" can only be put in blocks of loop control types\");<pre><code>      switch (block.GetFieldValue(\"FLOW\"))\n      {\n          case \"BREAK\":\n              loopCmdtor.SetFlowState(ControlFlowType.Break); \n              return;\n\n          case \"CONTINUE\":\n              loopCmdtor.SetFlowState(ControlFlowType.Continue); \n              return;\n      }\n  }</code></pre>  }</code></pre>\n<ol start=\"3\">\n<li>an async function that runs for a duration, or includes the call of the interpreter functions of its child blocks.</li></ol>\n<pre><code class=\"c# language-c#\">  [CodeInterpreter(BlockType = \"coroutine_wait_frame\")]\n  public class Coroutine_WaitFrame_Cmdtor : EnumeratorCmdtor\n  {\n      protected override IEnumerator Execute(Block block)\n      {\n          CmdEnumerator ctor = CSharp.Interpreter.ValueReturn(block, \"TIME\", new DataStruct(0));\n          yield return ctor;\n          DataStruct time = ctor.Data;<pre><code>      for (int i = 0; i &amp;lt; time.NumberValue.Value; i++)\n      {\n          yield return null;\n      }\n  }</code></pre>  }</code></pre></li>\n</ol>\n<p>So I wrapped all these logic in the underneath abstract class, and only expose the <code>Execute</code> function for the real translating code. If you are interested in the implementation, please <a href=\"https://github.com/imagicbell/ublockly/blob/master/Source/Script/Core/Code/Cmdtor.cs\" rel=\"noopener noreferrer\" target=\"_blank\">click here</a>.</p>\n<h2 id=\"section-runner\">Runner</h2>\n<p>Given the interpreters of blocks, and a workspace of connected blocks, how to run it? This is what the <strong>Runner</strong> does.</p>\n<p>The basic idea is to traverse the blocks based on the tree based hierarchy, and call the interpreter functions one by one. This calling sequence can't be decided before running, because we have variables which vary overtime and so make the running process unpredictable. In addition, the execution of a parent block may rely on the output of its child blocks. </p>\n<p>Unity coroutine manages the running of <code>IEnumerator</code> functions. This was how my initial runner worked:</p>\n<ol>\n<li>Unity coroutine starts running from the topmost block's <code>IEnumerator</code> interpreter function.</li>\n<li>In the body of the block's interpreter function, if it meets the <code>yield return</code> child's interpreter function, Unity coroutine will hang up the parent's interpreter function, enter child's, and come back when the child's function has completed.</li>\n<li>When a parent block's interpreter function has completed, we check if there is a next block, and continue the process util all blocks complete running their interpreter functions.</li>\n</ol>\n<p>Thanks to Unity coroutine, it saved my code to manage the running of nested <code>IEnumerator</code> functions, as mentioned above at the 2nd point. However, in the meantime, I lost the control. Once Unity coroutine started running from the function that I passed in, the process goes into a black box. I couldn't pause the running before or after a certain block. </p>\n<p><em>Unity coroutine has pause API, but it is unknown that whether it is paused at the entry/exit point of a block, or just at the midtime of a <code>YieldInstruction</code>, e.g. <code>yield return new WaitForSeconds()</code>.</em></p>\n<p>So I rewrote the coroutine logic based on the iteration feature of <code>IEnumerator</code>. Similiar to JS iterator, it has <code>MoveNext()</code> to move forward the process, and <code>Current</code> to access the current process. This is how it works now:</p>\n<ol>\n<li><p>It maintains a stack of <code>IEnumerator</code>. In the <code>while</code> loop,</p>\n<ol>\n<li>each time it peeks the top <code>IEnumerator</code> from the stack, </li>\n<li>runs it by looping <code>MoveNext()</code>, </li>\n<li>if another <code>IEnumerator</code> is met, pushes it into the stack, breaks the current loop, returns to step 1. </li>\n<li>the <code>while</code> loop finishes running when the stack is empty.</li></ol>\n<p>This is similar to how the call stack works in a computer program.</p></li>\n<li><p>It wraps the interpreter functions into an inherited <code>IEnumerator</code>, called <code>CmdEnumerator</code>, so it can identify the entry/exit point of interpreter functions by checking the type of current <code>IEnumerator</code>. </p></li>\n</ol>\n<p>With this runner, I get the full control of the running process. So I can</p>\n<ul>\n<li>implement the Debug Mode, that is run the block step by step, like debugging. </li>\n<li>print out the callstack.</li>\n<li>implement stack overflow exception.</li>\n</ul>\n<p>Please see this <a href=\"https://www.youtube.com/watch?v=U1bwXHrmnPw\" rel=\"noopener noreferrer\" target=\"_blank\">showcase video</a>. If you are interested in the code, please <a href=\"https://github.com/imagicbell/ublockly/blob/master/Source/Script/Core/Code/CmdRunner.cs\" rel=\"noopener noreferrer\" target=\"_blank\">click here</a>.</p>\n<h2 id=\"section-data\">Data</h2>\n<h3 id=\"section-variables\">Variables</h3>\n<p>Like Google Blockly, we have variables. In the scope of a workspace, we maintain a dictionary of variables, where the key is the name of the variables. So there is a limitation that <strong>in the scope of a workspace, the variables can't have duplicate names</strong>. Each time the runner starts a fresh run, all the variables in the dictionary are reset to the initial value.</p>\n<h3 id=\"section-type-definition\">Type Definition</h3>\n<p>Google Blockly has no concern about the data types, because it's Javascript. But we are here with C#, a strongly typed language. Our interpreter needs to know the exact type of the data passed in. But I don't want to expose the data type to annoy our ublockly users. So I wrapped all the data types that ublockly supports in a struct, called <code>DataStruct</code>.</p>\n<p>We support 5 data types:</p>\n<ul>\n<li><strong>Undefined</strong>: the data is not assigned with any data, similiar to <code>undefined</code> in JS. The default data type.</li>\n<li><strong>Boolean</strong>: <code>true</code> or <code>false</code>.</li>\n<li><strong>Number</strong>: our wrapper struct for numbers, strongly converting datas of boolean, int, float, double, string into float.</li>\n<li><strong>String</strong>: the original <code>string</code> type in C#. <code>char</code> will also be converted into this type.</li>\n<li><strong>List</strong>: <code>ArrayList</code> in C#. Allows elements of different types, but unifies the types when conducting math operations, or string joins.</li>\n</ul>\n<p>The <code>DataStruct</code> contains the real data and its data type, as well as the overrided operations like <code>+</code>, <code>-</code>, <code>=</code>, etc, providing convenience for data manipulation in ublockly.</p>"},"postNav":{"previous":"/posts/2021-6-5-build-my-website-image-opti","next":null},"morePosts":[{"slug":"2018-6-10-chain-animation-on-wheels","title":"Automatic Chain's Animation On wheel Models","date":"2018-06-10T16:00:00+08:00","locale":"en","readTime":3,"excerpt":"<p>In last blog, I introduced the construction of the chains on wheels. This blog will tell the animation calculations. The...</p>"},{"slug":"2018-6-7-auto-draw-chain-on-wheels","title":"Automatic Chain's Construction On wheel Models","date":"2018-06-07T16:00:00+08:00","locale":"en","ogImage":"/blog/assets/img-auto-draw-chain/3.jpg","readTime":2,"excerpt":"<p>Rencently I did have fun with a project which I'd like to share. It is to construct a chain automatically...</p>"},{"slug":"2018-3-31-thread-in-unity","title":"Use Thread In Unity","date":"2018-03-31T13:00:00+08:00","locale":"en","readTime":2,"excerpt":"<p>It's been a long time since my last blog, as I've recently spent plenty of time to save a dying...</p>"},{"slug":"2018-1-20-orthographic-camera-computing","title":"Restrict Object In Specified Screen Area Using Orthographic Camera","date":"2018-01-20T15:00:00+08:00","locale":"en","ogImage":"/blog/assets/img-orthographic-camera/1.JPG","readTime":3,"excerpt":"<p>I’ve encountered a problem to adjust the position of orthographic camera for restricting 3D objects in the specified rectangle area...</p>"}]},"__N_SSG":true}