{"pageProps":{"exps":[{"company":"Bloks Group","company-link":"https://www.bloks.com","title":"Senior Unity Developer","time":"October 2016 - March 2020","location":"Shanghai, China","logo":"/assets/resume/putao.jpg","slug":"putao","content":"<p>It was a tough time after the failure in <em>Com2Ply</em>. Meanwhile I began to realize the uncertainty of the game market. I decided to seek opportunities in other markets, which were more connected to our life. I joined <em>Putao</em>(ex-name of <em>Bloks Group</em>), a medium company targeting at Kid's Play and Education. During the early period in <em>Putao</em>, I led or joined in the development of several educational apps, such as story Ebook, English Learning App, and Coding Robot. It was sincerely a happy period in my career, as I had met several colleagues with whom I collaborated quite well and shared common interests. More importantly, I had seen more possibilities in what I could do. My vision had been broaden. I began to develop my own interest in spare time. This was how <a href=\"https://github.com/imagicbell/ublockly\" rel=\"noopener noreferrer\" target=\"_blank\">ublockly</a> came to life. </p>\n<p>However, in my late second year in <em>Putao</em>, it began to change its business, pouring all its effort to making toy bricks for kids, like <em>Lego</em>. I took the responsibility to lead the development of an internal tool, Block Editor, for designers to build block models. It was more like a Desktop App, involving a model editing window, complicated UI, file system, and massive resources exchange with server. I began to realize the inconvenience and painfulness of developing such an App using Unity. So I began to dive in Web technologies.</p>"},{"company":"Com2Ply","title":"Unity Game Developer","time":"August 2014 - September 2016","location":"Shanghai, China","logo":"/assets/resume/com2ply.jpg","slug":"com2ply","content":"<p>It was a bold decision to join <em>Com2Ply</em>, a startup just founded but consisted of several famous professionals in the game industry. Our initial aim was to develop a mobile ARPG game, making our gamers experience fantastic battle. My duty was implementing the gameplay, including avatar skills, AI, battle effects, score calculation, etc. It was a crucial and difficult task. However, I was guided by an expert in this specific field. From this collaboration, I had learned a lot from his rich experience. His desire to dive deep and the way of thinking outside the box also inspired me and influenced me ever since in my career. Thanks to this opportunity, I had grown fast. </p>\n<p>In the middle term, we created a very satisfying game, with which we gained a huge funding and support from a big game company. However, at last we failed to continue because of much interference from this big company and some uncontrollable issues. However, it was a valuable experience and had great influence in my career.</p>"},{"company":"Triniti Interactive","company-link":"http://www.trinitigame.com","title":"Junior Unity Game Developer","time":"June 2012 - June 2014","location":"Shanghai, China","logo":"/assets/resume/triniti.jpg","slug":"triniti","content":"<p>I started my career at <em>Triniti Interactive</em>, a young company but already having developed top listed mobile games in the market. I was very lucky to work with the lead programmer who produced the most popular game in the company. My initial responsibility was to add features and fix bugs for a bestseller. Due to my competency, I was assigned to be in charge of the incremental development of two popular games, which had helped me gain a lot of experience in Unity game development. Two years later, I began to seek opportunities to develop heavier games, but <em>TI</em> targeted at light mobile games and changes in their business had not been seen. So I left <em>TI</em>.</p>"}]},"__N_SSG":true}