{"pageProps":{"post":{"title":"旅行-新西兰","date":"2017-10-19T20:00:00+08:00","slug":"2017-10-19-travelling-nz","description":"A self-driving travel experience in New Zealand.","ogImage":"/blog/assets/img-travelling-nz/NZ1.png","categories":["Travel"],"readTime":7,"content":"<p>从新西兰回来已经一个多礼拜了，我问老公“还有感觉么”，他说“最多的还是驾车的疲惫感”… 其实我能够理解，对于一个程序员直男来说，不会小清新，对风景的记忆是很容易淡忘的… 而旅行的意义在收获美景之余，还有很多很多，我要帮他拾起来。<br>\n先奉上一张照片～</p>\n<p><img loading=\"lazy\" src=\"/blog/assets/img-travelling-nz/NZ1.png\" alt=\"\"></p>\n<h3 id=\"section-目的\">目的</h3>\n<p>老公（职业：程序员）一直很想走出去，去体验自由，去体验慢生活。我曾经在爱尔兰求学呆过一年半的时光，很想带他去一次，我们决定以后有了宝宝一起去。但是这次我们选择了新西兰，与爱尔兰有着相似，并且是一个移民国家。</p>\n<p>新西兰这个名字其实一点都不陌生，奶粉、蜂蜜、巧克力啦，就知道这是一个享受自然的地方。两年前看到闺蜜在朋友圈发了一张在<strong>霍比特村</strong>的照片，就萌生了想去的念头，但是连续十天以上的假期对于一对程序员夫妇来说实在是为难，连婚嫁都因为某些原因给浪费了…</p>\n<p>前段时间一个同事给我讲述了他蜜月在新西兰“跳伞”的经历，很是羡慕。而我上半年正好考到了驾照，跃跃欲试各种想开车。老公一拍掌，“走吧～”，那颗按耐不住的心终于促使我们决定请个长假连上国庆，去这个国家走一番！</p>\n<h3 id=\"section-行程\">行程</h3>\n<p>我们的行程是12天9晚，其中</p>\n<ul>\n<li>2晚飞机上</li>\n<li>北岛：2晚Auckland</li>\n<li>南岛：1晚Christchurch -&gt; 1晚Lake Tekapo -&gt; 3晚Queenstown -&gt; 1晚Dunedin -&gt; 1晚Christchurch</li>\n</ul>\n<p>其实行程有些紧，在南岛的每天几乎都有至少300公里的车程。在Queenstown呆的比较久，是因为跳伞需要考虑天气因素，所以加了容错时间，其中有一天我们去了最南端的Bluf，一个据说有着<strong>全球最南端星巴克的</strong>、能看到<strong>南极冰山</strong>的小镇，结果星爸爸不欢迎我们，小镇上所有的商户当天在下午3点就close了…冰山也不知道是见没见着，因为只看到了海平面远方隐隐的一条山脉，想必可能是初春融化了不少…</p>\n<p><strong>Lake Tekapo</strong>是一个让我们印象深刻的地方，上面的照片就是坐在她的边上拍的，为此我们特地找了个没人的角落，冒着可能跟她“亲密接触”的风险，趟着石头过去的。这一切是值得的，因为视野更开阔，湖面更静谧，世界更平静，仿佛我们被她像妈妈般包裹着，那一刻，绝妙，只有享受～</p>\n<h4 id=\"section-行程中最大的遗憾\">行程中最大的遗憾</h4>\n<p>准备行程中，我们了解到<strong>Lake Tekapo</strong>是世界上最美的观星胜地之一，可以看到一整条银河！虽然知道我们去的不是最佳时节，但是也仍然抱着“再怎么都比上海好”的幻想。不幸的是，当天晚上满天密不透光的乌云，这或许是因为这个地方太喜欢我们，希望我们下次再来…</p>\n<h3 id=\"section-印象\">印象</h3>\n<p>和爱尔兰相比，同样是岛国的他们有太多的相似：</p>\n<ul>\n<li>相似的地理因素，相似的气候，雨说来就来说走就走，天气预报没个准信；</li>\n<li>相似的地貌，大片的山丘，大片的草地，大片的“绿色”，以及点缀“绿色”的大片的羊群、牲畜；</li>\n<li>人少，这点我认为新西兰更甚一筹。南北岛的几个大城市我们都有路过，满街看到的是车，有些城市晚上7点以后大街上已经几乎没了人影。至少都柏林的夜晚相对来说热闹些吧，因为有各路酒吧，还有刚从实验室背着书包回家的学生们（比如说我～）。如果没有零零星星的中国游客，我甚至怀疑这是“宵禁”了…</li>\n<li>有一个古老的民族文化，并保留至今。新西兰：毛利文化，爱尔兰：凯尔特文化。</li>\n</ul>\n<p>当然也有不同，新西兰是个重旅游的国家，而中国当之无愧是其旅游人口的最大输出国。我们到访过的绝大多数地方（机场、酒店、娱乐场所等）都有中文，甚至是中文导购，而他们的官方语言“毛利语”却没有…</p>\n<h4 id=\"section-人少却什么也不缺\">人少却什么也不缺</h4>\n<p>在Christchurch的第一晚，也是新西兰南岛的第一晚，我们住的是民宿，是在离市区有30min车程的地方（这个距离在新西兰算是很郊外了）。过去的时候天已经黑了，我们担心会是一个不尽人意的地方，结果一进屋，我们就感慨这是我们梦寐以求的house，宽敞，温馨，现代化科技设备一个不缺。家里住着一对恩爱的老夫妻，和一只比我们家“酸奶”胖多了的猫咪。后来得知，这是他们在11年地震后重建的house，他们还给我们看了在地震前house生活点滴的照片。</p>\n<p><img loading=\"lazy\" src=\"/blog/assets/img-travelling-nz/NZ2.png\" alt=\"房东老奶奶\"></p>\n<p>这位房东老奶奶让我想起了在爱尔兰homestay的房东阿姨，让我想起了在爱尔兰生活的点滴，以及这位房东阿姨对我的kindness。当时的我困于学习的压力以及社交的狭隘，极度想家的我在某一个夜晚放肆的发泄了一番，第二天晚上阿姨就带我去酒吧放松了一下，以及开车带我兜风，开导我\"Everything will be fine~\"那股暖流至今仍然流在心中的某个地方。后来由于租金的问题我搬到了另外一个地方，这位阿姨在圣诞节前夜还邀请我去她家做客。我想，我一定会带着我的家庭再次去拜访她，感谢她～</p>\n<p>新西兰，爱尔兰，人都很少，但是什么也不缺，包括人与人之间的关怀、信任、美好～</p>\n<h3 id=\"section-驾车\">驾车</h3>\n<p>新西兰是最适合驾车旅游的国家之一，一点也不为过，沿途的风景自不必说，但是我认为<strong>文明驾车</strong>，以及<strong>齐全的交通设施</strong>才是它给我最深的印象。</p>\n<p>在主干道上过路口，不需要减速，因为支干道上的车在百米之外就已经候在路口等你了，即使在交通相对拥挤的Queenstown，也会根据车速留足够的时间。</p>\n<p>夜晚驾车，不会担心对面或者前方车辆开着大灯恶心你，即使是在非常漆黑的公路上。</p>\n<p>夜晚行驶在大多数公路上，是很漆黑的，如果乌云遮住了星星，就几乎完全没有其他照明，除了路边整齐排列的一个个反光警示桩。是的，一个不落的警示桩，是夜晚行车的好帮手～</p>\n<p>我们的旅途中经过了很多蜿蜒的山路，320度的急转也是常有，但是每个转弯处都有警示牌标着限速，老公说这个速度是过弯最舒适的～虽然我总是很怂的降低了速度，但是我总能看到速度很快过弯的车辆，那种轻快的感觉～</p>\n<p>白天行驶在公路上，看得到漫山遍野的羊咩咩却看不到牧羊人，唯一能看到的便是修路的工人了，即使是在很荒野的地段，感谢他们为我们完美的驾车体验提供了保障！整个旅途中没有看到损坏的路面，或者是被偷了井盖的坑…一条精神抖擞的公路笔直伸向远方，或者蜿蜒盘旋，与新西兰广阔的风景融为一体，令人赏心悦目～<br>\n<img loading=\"lazy\" src=\"/blog/assets/img-travelling-nz/NZ6.png\" alt=\"公路\"></p>\n<p>虽然在新西兰是左行右舵，但是我很快适应，并且在好的路段都能不知不觉飙到120（老公飙130），但是还是尽量遵守国家的限行速度100。</p>\n<p>一个字，“爽”！纪律是效率最大的保障～</p>\n<h3 id=\"section-跳伞\">跳伞</h3>\n<p>这是这段旅程的重点了！</p>\n<p>在此之前，我已经为此做了足够的功课，包括看了各路跳伞的视频，理解<strong>失重感</strong>，跳伞的正确姿势，跳伞的服装，甚至是跳伞前合适的饮食量…与此同时，闭上眼睛就会脑补自己跳伞的feel，有几次竟然被吓醒…用我老公的话说就是“心理建设相当充分”～</p>\n<p>因为天气预报一直认为我们在Qweenstown的三天都下雨，所以我们没有提前预定。然而Qweenstown迎接我们的第一天便是一个好天气，可是已经订不到当天的了（跳伞的人真多，我都敢跳了…），于是我们斩钉截铁的订了第二天的，尽管天气预报仍然认为会下雨…</p>\n<p>跳伞当天的早上还是有些乌云，我们有些担心，但是仍然出发驶向Skydive-Wanaka的基地。一路上的我，反而很平静，心理建设相当充分了～</p>\n<p>45min的车程，到了目的地的时候，云已经散开了，天空格外的清澈，抬头就能看到天空中飘着的滑翔伞，当然紫外线也是少不了的… </p>\n<p>我们约的是中午12点，签完生死状，换完衣服，我和老公就约好在手上写上我们的名字，做相同的动作。然后见到了我的跳伞教练和摄影教练。然后依次上飞机。因为我是倒数第二个跳，所以先上飞机（在机舱里是倒着坐的），不想猛的撞了飞机舱门一记，幽默的跳伞教练跟我说：“It's no good luck. You may die!” 哈哈，但是当时心里还是有点担心会影响到。</p>\n<p>飞机上去的很平稳，不知不觉就到了12000英尺的高空，飞机舱门打开，教练们就不由分说的带着“包袱”一个接一个的跳下去了，老公在我前面，忽的一下就没了人影，哈哈，有点慌～</p>\n<p>我到了飞机舱口的时候，往下看，我的天，一点都不害怕竟然！因为参照物离我真的太遥远了，就跟在飞机窗口往下看的感觉一样～</p>\n<p>就这么跳了…</p>\n<p>完全自由落体的那5s，我感觉到心往下沉，但是没有跳楼机那么迅速，可惜我仍然是条件反射的闭上了眼睛，但是我能够记得我要把腿弯起来，嘿嘿~</p>\n<p><img loading=\"lazy\" src=\"/blog/assets/img-travelling-nz/NZ3.png\" alt=\"\"></p>\n<p>接着感觉到有一点拉扯，平稳了，平稳了，平稳了！小伞打开了，教练拍拍我的肩膀，我就立刻睁开眼，努力的完成之前跟老公约定的动作，因为风太大了，手合不拢，还是教练帮我了（老公的教练没有帮他，他没有把手合拢！是的，他没有完成！）。然后就是尽情的享受，那一刻，在飞翔！</p>\n<p><img loading=\"lazy\" src=\"/blog/assets/img-travelling-nz/NZ4.png\" alt=\"\"></p>\n<p><img loading=\"lazy\" src=\"/blog/assets/img-travelling-nz/NZ5.png\" alt=\"\"></p>\n<p>接下来的滑翔伞时间过的很快，教练想的是还有下一波吧。Anyway，那一刻，在飞翔！虽然脑补了很多次，可是那一刻的感觉，只有去真实的体验～</p>\n<p>唯一没有预料到的是，我的耳膜对压力变化的承受能力太弱，在自由落体的50s时间内，一直“咔呲咔呲”的响，并且疼，虽然那个时候顾及不到了…但是后来直接导致了第一次飞机降落时耳朵痛到爆炸，连着两遍的脑神经也是，一度怀疑是耳膜坏了… 这是回程的第一段，第二段是大飞机就好多了（Christchurch-&gt;Auckland-&gt;Shanghai）。下次跳伞前要先问问医生了。</p>\n<p>对我来说，准备功课充足了，临场才有更好的体验～</p>\n<p>老公因为一直不怕这些极限运动，因此跳完不一会儿就没啥感觉了，还怪教练太草率～</p>\n<h3 id=\"section-插曲\">插曲</h3>\n<p>任何旅途都不是完美的，我们也发生了一些不愉快。同行的还有另外两个朋友，所谓重口难调，吃饭问题困扰了我们很久，特别是我（有着一个“中国胃”）。后来老公私下委婉的指出了我的不妥之处：自己的想法在当下可以大胆直白的表达出来（比如想吃什么），只有表达出来了才能知道别人愿不愿意接受（当然也要注意表达方法），事后再通过表情或者肢体语言有意或无意的表达不愉快反倒增加了别人的困扰…<br>\n事后问了下同行的朋友，他们其实都可以接受大家各吃各的，各玩各的，说一下就好了～<br>\n引以为戒，学会表达，是人际交往能力的体现。</p>\n<h3 id=\"section-这不是一篇流水账\">这不是一篇流水账</h3>\n<p>旅游结束了，随着时间的流逝，我想一些对美景的记忆也会慢慢淡化，对整个行程中哪天在哪里做了什么也会慢慢忘记，记下一篇游记因此很重要。而我只想把那些深刻的印象留下来，回头再看时，便知道这是新西兰，以及我们因旅途而收获的改变～</p>"},"postNav":{"previous":"/posts/2017-10-14-blockly-two","next":"/posts/2017-10-22-blockly-three"},"morePosts":[{"slug":"2021-6-5-build-my-website-image-opti","title":"How To Build My Own Website (4) - Image Optimization","date":"2021-06-05T20:00:00+08:00","locale":"en","excerpt":"This article illustrates how I applied image optimization to improve the performance of my website.","readTime":2},{"slug":"2021-3-14-build-my-website-style","title":"How To Build My Own Website (3) - Style","date":"2021-03-14T20:00:00+08:00","locale":"en","excerpt":"This article illustrates how I style my own website using Tailwindcss framework, make theme color configurable, and apply interactive animations.","readTime":2},{"slug":"2021-3-12-build-my-website-markdown","title":"How To Build My Own Website (2) - Markdown","date":"2021-03-12T20:00:00+08:00","locale":"en","readTime":3,"excerpt":"<p>Parsing and displaying Markdown files are one of the most important things in building a personal website, because all my...</p>"},{"slug":"2021-3-10-build-my-website-nextjs","title":"How To Build My Own Website (1) - Next.js","date":"2021-03-10T20:00:00+08:00","locale":"en","readTime":5,"excerpt":"<p>I had always dreamed of building my own website, to express myself, to keep memory of what I have done,...</p>"}]},"__N_SSG":true}