{"pageProps":{"post":{"title":"How To Build My Own Website (4) - Image Optimization","date":"2021-06-05T20:00:00+08:00","slug":"2021-6-5-build-my-website-image-opti","categories":["Front-End"],"readTime":2,"content":"<h2 id=\"section-contents\">Contents</h2>\n<ol>\n<li><a href=\"/posts/2021-3-10-build-my-website-nextjs\" rel=\"noopener noreferrer\" target=\"_blank\">The choice of Next.js</a></li>\n<li><a href=\"/posts/2021-3-12-build-my-website-markdown\" rel=\"noopener noreferrer\" target=\"_blank\">Parse and Display Markdown</a></li>\n<li><a href=\"/posts/2021-3-14-build-my-website-style\" rel=\"noopener noreferrer\" target=\"_blank\">Style my website</a></li>\n<li>Image Optimization</li>\n</ol>\n<p><br></p>\n<p>I didn't have much consideration about image optimization when developing my website using <a href=\"https://nextjs.org/\" rel=\"noopener noreferrer\" target=\"_blank\">Next.js</a>, because it provides a component  <a href=\"https://nextjs.org/docs/api-reference/next/image\" rel=\"noopener noreferrer\" target=\"_blank\"><code>next/image</code></a> which is an extension of  the HTML <code>&lt;img&gt;</code> element and encapsulates image optimization. But when I exported my website project to static HTML for publishing on Github pages, an error prompted.</p>\n<blockquote>\n  <p>Error: Image Optimization using Next.js' default loader is not compatible with <code>next export</code>.</p>\n</blockquote>\n<p>Then I found the caveat on Next's document:</p>\n<blockquote>\n  <p>The <a href=\"https://nextjs.org/docs/api-reference/next/image\" rel=\"noopener noreferrer\" target=\"_blank\"><code>next/image</code></a> component's default loader is not supported when using <code>next export</code>. However, other <a href=\"https://nextjs.org/docs/basic-features/image-optimization#loader\" rel=\"noopener noreferrer\" target=\"_blank\">loader</a> options will work.</p>\n</blockquote>\n<p>However, currently I didn't intend to rely on third-party image optimizer, as:</p>\n<ol>\n<li>it might need additional configuration, like registering account on their platform, supplying images somewhere on the cloud storage, etc.</li>\n<li>I'm not making a big website having large amount of images on one page. Actually, there might be at most 5 images.</li>\n</ol>\n<p>There must be some easier ways. I found issues on Next.js GitHub project that discussed on it. Some guys recommended to use <a href=\"https://github.com/cyrilwanner/next-optimized-images\" rel=\"noopener noreferrer\" target=\"_blank\">next-optimized-images</a>, which could be a replacement.</p>\n<p>It works quite well. It supports automatic optimization of images of different types, like jpeg, png, etc, as well as provides webp converting, which largely reduces the size of images. It also enables to generate a low quality image as a placeholder until the real big image has load. Here is one of my usage:</p>\n<p>My original homepage image, which was 8mb, took tons of seconds to load. I used the webp conversion, which resulting much smaller size with 330kb, and provided the fallback jpeg image using <code>&lt;picture&gt;</code> considering that webp is not supported by all the browsers right now. The resulted TTFB of this image at my home network was reduced to around 300ms and the download time was about 500-1000ms. It was much faster than before. I also applied the <code>?lqip</code> query to generate a placeholder and displayed it under the real image, so the screen won't be blank during this waiting time.</p>\n<p>But when it came to display images of my blog, which was written in markdown, troubles came. <a href=\"https://github.com/cyrilwanner/next-optimized-images\" rel=\"noopener noreferrer\" target=\"_blank\">next-optimized-images</a> uses <code>require</code> to assign the image url, which only accepts static path:</p>\n<pre><code class=\"jsx language-jsx\">&lt;img src={require('./images/my-image.jpg')} /&gt;</code></pre>\n<p>But the markdown files are parsed and converted to HTML to display in browsers. The image urls defined in markdown files are fetched and stored in variables. How to <code>require</code> a variable then?</p>\n<p>It seemed impossible. But maybe I could add an additional step in the <a href=\"https://github.com/cyrilwanner/next-optimized-images\" rel=\"noopener noreferrer\" target=\"_blank\">next-optimized-images</a> working pipeline, to load all the images from my blogs before the optimization process. It involved too much work though. There must be some easier ways again.</p>\n<p>Then I found off-line image optimization tools. I used <a href=\"https://imageoptim.com/mac\" rel=\"noopener noreferrer\" target=\"_blank\">ImageOptim</a>. Similar to next-optimized-images, they share most of the dominating optimization tools for reducing images' size. So the results were almost the same. Just one more step to drag and drop though. </p>\n<h2 id=\"section-next-thoughts\">Next Thoughts</h2>\n<p>My solution to the image optimization currently won't run in a long way. If in the future the website grows, having more images or videos, the page load speed might not be ideal. There are at least two things I could do:</p>\n<ol>\n<li>use third-party image optimization service.</li>\n<li>support responsive images for screens of difference sizes.</li>\n</ol>"},"postNav":{"previous":"/posts/2021-3-14-build-my-website-style","next":null},"morePosts":[{"slug":"2021-3-14-build-my-website-style","title":"How To Build My Own Website (3) - Style","date":"2021-03-14T20:00:00+08:00","locale":"en","excerpt":"This article illustrates how I style my own website using Tailwindcss framework, make theme color configurable, and apply interactive animations.","readTime":2},{"slug":"2021-3-12-build-my-website-markdown","title":"How To Build My Own Website (2) - Markdown","date":"2021-03-12T20:00:00+08:00","locale":"en","readTime":3,"excerpt":"<p>Parsing and displaying Markdown files are one of the most important things in building a personal website, because all my...</p>"},{"slug":"2021-3-10-build-my-website-nextjs","title":"How To Build My Own Website (1) - Next.js","date":"2021-03-10T20:00:00+08:00","locale":"en","readTime":5,"excerpt":"<p>I had always dreamed of building my own website, to express myself, to keep memory of what I have done,...</p>"},{"slug":"2021-2-19-mock-requestanimationframe-in-jest","title":"Mock requestAnimationFrame in Jest","date":"2021-02-19T10:00:00+08:00","locale":"en","readTime":1,"excerpt":"<p>When I wrote test for my tiny rhythm game, I realized that all the browser based actions needed to be...</p>"}]},"__N_SSG":true}